myinit.org
#+STARTUP: overview
* Interface Tweaks 
** Startup General Settings
#+BEGIN_SRC emacs-lisp
;; (setq initial-buffer-choice "~/Dropbox/index.org")

;; Hide Scroll bar,menu bar, tool bar
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode    -1)
(menu-bar-mode -1)

;; Line numbering
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)

;; Display battery for when in full screen mode 
;; Uncomment in laptops
(display-battery-mode t)

;; Misc stuff
(fset 'yes-or-no-p 'y-or-n-p)
(setenv "HOME" "/home/alkhaldieid/")
(server-start)

(setq initial-scratch-message "Welcome Abu-Saad") ; print a default message in the empty scratch buffer opened at startup
;; show paranthasis
(show-paren-mode 1)
;;set the default font"
(set-default-font "Ubuntu Mono-25")
(global-visual-line-mode t)


(setq make-backup-files nil) ; stop creating backup~ files
(setq auto-save-default nil) ; stop creating #autosave# files
(setq delete-old-versions -1 )
(setq inhibit-startup-screen t )
;; Remove initial buffer, set index file
(setq inhibit-startup-message t)
(setq ring-bell-function 'ignore )
(setq coding-system-for-read 'utf-8 )
(setq coding-system-for-write 'utf-8 )
(setq sentence-end-double-space nil)
(setq default-fill-column 80)
(setq initial-scratch-message "")
(setq word-wrap t)

;; https://github.com/danielmai/.emacs.d/blob/master/config.org
(defalias 'yes-or-no-p 'y-or-n-p)
(blink-cursor-mode -1)
(show-paren-mode t)

(setq-default mode-line-format nil)

;; (toggle-word-wrap)
(global-auto-revert-mode t)
(electric-pair-mode)
#+END_SRC

* Evil mode stuff
** Vim mode
#+BEGIN_SRC emacs-lisp
(use-package evil
  :ensure t
  :config
  (evil-mode 1)
  (setq-default evil-escape-delay 0.2))
#+END_SRC

* General
+BEGIN_SRC emacs-lisp
(use-package general 
  :ensure t
  :config (general-define-key
            :states '(normal visual insert emacs)
            :prefix "SPC"
            :non-normal-prefix "M-SPC"
            "/"  '(counsel-rg :which

  
)
+END_SRC


* Evil Leader Keybindings
+BEGIN_SRC emacs-lisp

;; set the leader key
(evil-leader/set-leader "<SPC>")
;; use (evil-leader/set-key to bind keys in the leader map

(evil-leader/set-key
 "ff" 'find-file
 "d"'(lambda() (interactive) (find-file "~/Dropbox/second"))
 ;; buffers

 ;; files
 ;; cf files
 "cfe" '(lambda() (interactive) (find-file "~/.emacs.d/init.el"))
 "cfi" '(lambda() (interactive) (find-file "~/.config/i3/config"))
 "cfa" '(lambda() (interactive) (find-file "~/.config/aliasrc"))
 "cfd" '(lambda() (interactive) (find-file "~/.config/directories"))
 "cfk" '(lambda() (interactive) (find-file "~/.emacs.d/userConfig/keybindings.el"))
 ;; zoom-in and out
 "=" 'text-scale-increase
 "-" 'text-scale-decrease
 ;; org roam
 "nl" 'org-roam
 "nf" 'org-roam-find-file
 "ng" 'org-roam-show-graph
 "ni" 'org-roam-insert
 ;; org-roam-bibtex
 "na" 'orb-note-actions
 ;; syn layer  keybindings
 "ss" 'synonyms
 "sl" 'synosaurus-lookup
 "sr" 'synosaurus-choose-and-replace
 "si" 'synosaurus-choose-and-insert
 ;; org-recoll keys
 "ps" 'org-recoll-search
 "pu" 'org-recoll-update-index
 ;; evil-commentry
;; ";" evil-commentry-line
 )
 #+END_SRC
* Theming & Aesthethic
#+BEGIN_SRC emacs-lisp
(use-package dracula-theme
   :config
   (load-theme 'dracula t)
   :ensure t)
   

(global-hl-line-mode t) ;; This highlights the current line in the buffer

(use-package beacon ;; This applies a beacon effect to the highlighted line
   :ensure t
   :config
   (beacon-mode 1))
#+END_SRC

* Org Mode Stuff
** Aesthetics, customizations
#+BEGIN_SRC emacs-lisp
  (use-package org-superstar  ;; Improved version of org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
    
  (setq org-startup-indented t)           ;; Indent according to section
  (setq org-startup-with-inline-images t) ;; Display images in-buffer by default
#+END_SRC

** Evil-org for evil-mode integration
This is very fancy, it treats org-mode elements (i.e. sections, source blocks, tables)
as regular text objects ( 'ae' object ). Additionally, it allows reordering stuff using
M-j, M-k, M-l and M-h instead of the regular M-<arrow keys>.
Operators that deal with indentation ( < and > ) also indent headers.
#+BEGIN_SRC emacs-lisp
(use-package evil-org
  :ensure t
  :after (evil org)
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme '(navigation insert textobjects additional calendar))))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+END_SRC

** Org-agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
   '(("h" "Daily habits"
      ((agenda ""))
      ((org-agenda-show-log t)
       (org-agenda-ndays 7)
       (org-agenda-log-mode-items '(state))
       (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ":DAILY:"))))))
#+END_SRC

** Org-babel
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
#+END_SRC

